# WorkshopInstructions Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarFreeFormAccessor..::..WorkshopInstructions Property
RebarFreeFormAccessor Class See Also
---
Identifies the workshop instructions of the current Rebar element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2019
# Syntax
C#
---
```text
public RebarWorkInstructions WorkshopInstructions { get; set; }
```

Visual Basic
---
```text
Public Property WorkshopInstructions As RebarWorkInstructions
	Get
	Set
```

Visual C++
---
```text
public:
property RebarWorkInstructions WorkshopInstructions {
	RebarWorkInstructions get ();
	void set (RebarWorkInstructions value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace